# INTRODUCTION TO PANDAS LIBRARY IN PYTHON

In [8]:
import pandas as pd
list=[1,2,3,4,5,6,"Shruti"]
print(list)

[1, 2, 3, 4, 5, 6, 'Shruti']

In [3]:
s1=pd.Series(list)
print(s1)
print(type(list))

0         1
1         2
2         3
3         4
4         5
5         6
6    Shruti
dtype: object
<class 'list'>

In [5]:
s1=pd.Series([1,2,3,4])
print(s1)

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
#EMPTY LIST
s1=pd.Series([])
print(s1)

Series([], dtype: object)

In [9]:
#SERIES ARE USING SET 
s1=pd.Series([1,2,3,4],index={'a','b','c','d'})
print(s1)

b    1
d    2
c    3
a    4
dtype: int64

In [11]:
#SERIES ARE USING SET FLOATING NUMBERS
s1=pd.Series([1,2,3,4],index={'A','B','C','D'},dtype=float)
print(s1)

C    1.0
B    2.0
A    3.0
D    4.0
dtype: float64

In [13]:
s1=pd.Series([1,2,3,4],index=['A','B','C','D'],dtype=float)
print(s1)

A    1.0
B    2.0
C    3.0
D    4.0
dtype: float64

In [7]:
s1=pd.Series(0.7,index=['A','B','C','D'],dtype=float)
print(s1)

A    0.7
B    0.7
C    0.7
D    0.7
dtype: float64

In [29]:
#SERIES USE IN DICTINORY
s=pd.Series({'A':20,'B':30})
print(s)

a    20
b    30
dtype: int64

In [37]:
s=pd.Series([1,2,3,4,5])
print(s[0:3])

0    1
1    2
2    3
dtype: int64

In [39]:
max(s)

5

In [41]:
min(s)

1

In [43]:
s=pd.Series([1,2,3,4,5])
s1=pd.Series([6,7,8,9,10])
print(s+s1)

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [45]:
s=pd.Series([1,2,3,4,5])
s1=pd.Series([6,7,8,9,10])
print(s*s1)

0     6
1    14
2    24
3    36
4    50
dtype: int64

# DATA FRAME

In [47]:
data=pd.DataFrame()
print(data)

Empty DataFrame
Columns: []
Index: []

In [51]:
list=[1,2,3,4]
print(list)
data=pd.DataFrame(list)
print(data)

[1, 2, 3, 4]
   0
0  1
1  2
2  3
3  4

In [57]:
#LIST OF LIST BY USING DATA FRAME
list=[[1,2,3,4],[5,6,7,8],[9,10,11,12]]
print(list)
data=pd.DataFrame(list)
print(data)

[[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]
   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [59]:
list=[[1,2,3,4],[5,6,7,8],[9,10,11,12]]
list1=[[13,14,15,16],[17,18,19,20],[21,22,23,24]]
data=pd.DataFrame()
print(data)

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

In [3]:
import pandas as pd
list=[[1,2,3,4],[5,6,7,8]]
print(list)
d=pd.DataFrame(list)
list1=[[11,12,13,14],[15,16,17,18]]
print(list1)
d1=pd.DataFrame(list1)
print(list+list1)

[[1, 2, 3, 4], [5, 6, 7, 8]]
[[11, 12, 13, 14], [15, 16, 17, 18]]
[[1, 2, 3, 4], [5, 6, 7, 8], [11, 12, 13, 14], [15, 16, 17, 18]]

# How to upload csv file

In [4]:
import pandas as pd
dataset=pd.read_csv("weather_data_cities.csv")
dataset

           day      city  temperature  windspeed   event
0   01-01-2017       NaN         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          NaN         12    Snow
3   01-04-2017  new york         33.0          7   Sunny
4   01-01-2017    mumbai         90.0          5   Sunny
5   01-02-2017    mumbai         85.0         12     NaN
6   01-03-2017    mumbai         87.0         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8  Cloudy
11  01-04-2017     paris         42.0         10  Cloudy

# For data type

In [6]:
type(dataset)

pandas.core.frame.DataFrame

For getting index columns

In [10]:
dataset.columns

Index(['day', 'city', 'temperature', 'windspeed', 'event'], dtype='object')

In [12]:
#for using first column 
dataset=pd.read_csv(r"weather_data_cities.csv",usecols=[0])
print(dataset)

           day
0   01-01-2017
1   01-02-2017
2   01-03-2017
3   01-04-2017
4   01-01-2017
5   01-02-2017
6   01-03-2017
7   01-04-2017
8   01-01-2017
9   01-02-2017
10  01-03-2017
11  01-04-2017

In [14]:
#for n rows
dataset=pd.read_csv(r"weather_data_cities.csv",nrows=4)
print(dataset)

          day      city  temperature  windspeed  event
0  01-01-2017       NaN         32.0          6   Rain
1  01-02-2017  new york         36.0          7  Sunny
2  01-03-2017  new york          NaN         12   Snow
3  01-04-2017  new york         33.0          7  Sunny

In [16]:
#for using first column and second
dataset=pd.read_csv(r"weather_data_cities.csv",usecols=[0,1])
print(dataset)

           day      city
0   01-01-2017       NaN
1   01-02-2017  new york
2   01-03-2017  new york
3   01-04-2017  new york
4   01-01-2017    mumbai
5   01-02-2017    mumbai
6   01-03-2017    mumbai
7   01-04-2017    mumbai
8   01-01-2017     paris
9   01-02-2017     paris
10  01-03-2017     paris
11  01-04-2017     paris

In [18]:
dataset=pd.read_csv(r"weather_data_cities.csv",usecols=[0,1,3])
print(dataset)

           day      city  windspeed
0   01-01-2017       NaN          6
1   01-02-2017  new york          7
2   01-03-2017  new york         12
3   01-04-2017  new york          7
4   01-01-2017    mumbai          5
5   01-02-2017    mumbai         12
6   01-03-2017    mumbai         15
7   01-04-2017    mumbai          5
8   01-01-2017     paris         20
9   01-02-2017     paris         13
10  01-03-2017     paris          8
11  01-04-2017     paris         10

In [20]:
#for skiping any row
dataset=pd.read_csv("weather_data_cities.csv",skiprows=[1])
print(dataset)

           day      city  temperature  windspeed   event
0   01-02-2017  new york         36.0          7   Sunny
1   01-03-2017  new york          NaN         12    Snow
2   01-04-2017  new york         33.0          7   Sunny
3   01-01-2017    mumbai         90.0          5   Sunny
4   01-02-2017    mumbai         85.0         12     NaN
5   01-03-2017    mumbai         87.0         15     Fog
6   01-04-2017    mumbai         92.0          5    Rain
7   01-01-2017     paris         45.0         20   Sunny
8   01-02-2017     paris         50.0         13  Cloudy
9   01-03-2017     paris         54.0          8  Cloudy
10  01-04-2017     paris         42.0         10  Cloudy

In [22]:
#to make index of any columns
dataset=pd.read_csv("weather_data_cities.csv",index_col='city')
print(dataset)

                 day  temperature  windspeed   event
city
NaN       01-01-2017         32.0          6    Rain
new york  01-02-2017         36.0          7   Sunny
new york  01-03-2017          NaN         12    Snow
new york  01-04-2017         33.0          7   Sunny
mumbai    01-01-2017         90.0          5   Sunny
mumbai    01-02-2017         85.0         12     NaN
mumbai    01-03-2017         87.0         15     Fog
mumbai    01-04-2017         92.0          5    Rain
paris     01-01-2017         45.0         20   Sunny
paris     01-02-2017         50.0         13  Cloudy
paris     01-03-2017         54.0          8  Cloudy
paris     01-04-2017         42.0         10  Cloudy

In [10]:
#for setting no header
dataset=pd.read_csv("weather_data_cities.csv",header=None)
print(dataset)

             0         1            2          3       4
0          day      city  temperature  windspeed   event
1   01-01-2017       NaN           32          6    Rain
2   01-02-2017  new york           36          7   Sunny
3   01-03-2017  new york          NaN         12    Snow
4   01-04-2017  new york           33          7   Sunny
5   01-01-2017    mumbai           90          5   Sunny
6   01-02-2017    mumbai           85         12     NaN
7   01-03-2017    mumbai           87         15     Fog
8   01-04-2017    mumbai           92          5    Rain
9   01-01-2017     paris           45         20   Sunny
10  01-02-2017     paris           50         13  Cloudy
11  01-03-2017     paris           54          8  Cloudy
12  01-04-2017     paris           42         10  Cloudy

In [26]:
#for giving personalize heading
dataset=pd.read_csv("weather_data_cities.csv",names=['id','gen','math','eng','total'])
print(dataset)

            id       gen         math        eng   total
0          day      city  temperature  windspeed   event
1   01-01-2017       NaN           32          6    Rain
2   01-02-2017  new york           36          7   Sunny
3   01-03-2017  new york          NaN         12    Snow
4   01-04-2017  new york           33          7   Sunny
5   01-01-2017    mumbai           90          5   Sunny
6   01-02-2017    mumbai           85         12     NaN
7   01-03-2017    mumbai           87         15     Fog
8   01-04-2017    mumbai           92          5    Rain
9   01-01-2017     paris           45         20   Sunny
10  01-02-2017     paris           50         13  Cloudy
11  01-03-2017     paris           54          8  Cloudy
12  01-04-2017     paris           42         10  Cloudy

In [ ]:
#for knowing no. of rows and colums
dataset.shape

In [28]:
#for information
dataset=pd.read_csv("weather_data_cities.csv")
dataset.info

<bound method DataFrame.info of            day      city  temperature  windspeed   event
0   01-01-2017       NaN         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          NaN         12    Snow
3   01-04-2017  new york         33.0          7   Sunny
4   01-01-2017    mumbai         90.0          5   Sunny
5   01-02-2017    mumbai         85.0         12     NaN
6   01-03-2017    mumbai         87.0         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8  Cloudy
11  01-04-2017     paris         42.0         10  Cloudy>

In [30]:
#printing top 5 rows
dataset.head()

          day      city  temperature  windspeed  event
0  01-01-2017       NaN         32.0          6   Rain
1  01-02-2017  new york         36.0          7  Sunny
2  01-03-2017  new york          NaN         12   Snow
3  01-04-2017  new york         33.0          7  Sunny
4  01-01-2017    mumbai         90.0          5  Sunny

In [32]:
#for printing last 5 
dataset.tail()

           day    city  temperature  windspeed   event
7   01-04-2017  mumbai         92.0          5    Rain
8   01-01-2017   paris         45.0         20   Sunny
9   01-02-2017   paris         50.0         13  Cloudy
10  01-03-2017   paris         54.0          8  Cloudy
11  01-04-2017   paris         42.0         10  Cloudy

In [34]:
import pandas as pd
df=pd.read_csv("weather_data_cities.csv")
df

           day      city  temperature  windspeed   event
0   01-01-2017       NaN         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          NaN         12    Snow
3   01-04-2017  new york         33.0          7   Sunny
4   01-01-2017    mumbai         90.0          5   Sunny
5   01-02-2017    mumbai         85.0         12     NaN
6   01-03-2017    mumbai         87.0         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8  Cloudy
11  01-04-2017     paris         42.0         10  Cloudy

In [36]:
df.loc[1,'city']

'new york'

In [33]:
df.loc[1:5,'temperature']

1    36.0
2     NaN
3    33.0
4    90.0
5    85.0
Name: temperature, dtype: float64

In [45]:
df.iloc[5]

day            01-02-2017
city               mumbai
temperature          85.0
windspeed              12
event                 NaN
Name: 5, dtype: object

In [43]:
df.iloc[[0]]

          day city  temperature  windspeed event
0  01-01-2017  NaN         32.0          6  Rain

In [49]:
df.iloc[:,0]

0     01-01-2017
1     01-02-2017
2     01-03-2017
3     01-04-2017
4     01-01-2017
5     01-02-2017
6     01-03-2017
7     01-04-2017
8     01-01-2017
9     01-02-2017
10    01-03-2017
11    01-04-2017
Name: day, dtype: object

In [53]:
df.iloc[[0,1],[0,1]]

          day      city
0  01-01-2017       NaN
1  01-02-2017  new york

In [42]:
df.iloc[0:5]

          day      city  temperature  windspeed  event
0  01-01-2017       NaN         32.0          6   Rain
1  01-02-2017  new york         36.0          7  Sunny
2  01-03-2017  new york          NaN         12   Snow
3  01-04-2017  new york         33.0          7  Sunny
4  01-01-2017    mumbai         90.0          5  Sunny

In [38]:
people={"firstname":["Shruti","Siya","Sitvat"],"lastname":["Tiwari","Gajbhiye","Fatima"],"Gender":["Female","Female","female"]}
df1=pd.DataFrame(people)
df1

  firstname  lastname  Gender
0    Shruti    Tiwari  Female
1      Siya  Gajbhiye  Female
2    Sitvat    Fatima  female

In [40]:
df1.set_index("Gender")

       firstname  lastname
Gender
Female    Shruti    Tiwari
Female      Siya  Gajbhiye
female    Sitvat    Fatima

In [44]:
import pandas as pd
df1=pd.read_csv("weather_data_cities.csv")
df1

           day      city  temperature  windspeed   event
0   01-01-2017       NaN         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          NaN         12    Snow
3   01-04-2017  new york         33.0          7   Sunny
4   01-01-2017    mumbai         90.0          5   Sunny
5   01-02-2017    mumbai         85.0         12     NaN
6   01-03-2017    mumbai         87.0         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8  Cloudy
11  01-04-2017     paris         42.0         10  Cloudy

In [46]:
df1.isnull()

      day   city  temperature  windspeed  event
0   False   True        False      False  False
1   False  False        False      False  False
2   False  False         True      False  False
3   False  False        False      False  False
4   False  False        False      False  False
5   False  False        False      False   True
6   False  False        False      False  False
7   False  False        False      False  False
8   False  False        False      False  False
9   False  False        False      False  False
10  False  False        False      False  False
11  False  False        False      False  False

In [48]:
df1.isnull().sum()

day            0
city           1
temperature    1
windspeed      0
event          1
dtype: int64

In [50]:
df1.notnull()

     day   city  temperature  windspeed  event
0   True  False         True       True   True
1   True   True         True       True   True
2   True   True        False       True   True
3   True   True         True       True   True
4   True   True         True       True   True
5   True   True         True       True  False
6   True   True         True       True   True
7   True   True         True       True   True
8   True   True         True       True   True
9   True   True         True       True   True
10  True   True         True       True   True
11  True   True         True       True   True

In [54]:
df1.isnull().sum().sum()

3

In [56]:
df.notnull().sum()

day            12
city           11
temperature    11
windspeed      12
event          11
dtype: int64

In [58]:
#for filling null value
df1.fillna(7)

           day      city  temperature  windspeed   event
0   01-01-2017         7         32.0          6    Rain
1   01-02-2017  new york         36.0          7   Sunny
2   01-03-2017  new york          7.0         12    Snow
3   01-04-2017  new york         33.0          7   Sunny
4   01-01-2017    mumbai         90.0          5   Sunny
5   01-02-2017    mumbai         85.0         12       7
6   01-03-2017    mumbai         87.0         15     Fog
7   01-04-2017    mumbai         92.0          5    Rain
8   01-01-2017     paris         45.0         20   Sunny
9   01-02-2017     paris         50.0         13  Cloudy
10  01-03-2017     paris         54.0          8  Cloudy
11  01-04-2017     paris         42.0         10  Cloudy